---
kind: method
id: M:Autodesk.Revit.UI.UISaveAsOptions.#ctor
source: html/4e5c5559-3c9f-571e-af04-62380dac28b4.htm
---
# Autodesk.Revit.UI.UISaveAsOptions.#ctor Method

Default constructor.

## Syntax (C#)
```csharp
public UISaveAsOptions()
```